## Plan Result (sandbox-uksouth-enterprise)




<pre><code>Plan: 93 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azuread_application.app
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azuread_application_password.token
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azuread_group.group[&#34;Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azuread_group.group[&#34;Key Vault Administrator&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azuread_group.group[&#34;Owner&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azuread_group.group[&#34;Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azuread_group.group[&#34;Security Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azuread_group.group[&#34;Storage Blob Data Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azuread_service_principal.sp
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azuredevops_serviceendpoint_azurerm.endpointazure
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_key_vault.kv
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_access_policy.permissions
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.sp_app_id
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.sp_object_id
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_key_vault_secret.sp_token
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_storage_account.sa
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].azurerm_storage_container.sc
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].random_uuid.app_uuid
  * module.cft_non_production_subscriptions[&#34;DCD-RBAC-NONPRODUCTION&#34;].time_rotating.one_year
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azuread_application.app
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azuread_application_password.token
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azuread_group.group[&#34;Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azuread_group.group[&#34;Key Vault Administrator&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azuread_group.group[&#34;Owner&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azuread_group.group[&#34;Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azuread_group.group[&#34;Security Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azuread_group.group[&#34;Storage Blob Data Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azuread_service_principal.sp
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azuredevops_serviceendpoint_azurerm.endpointazure
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_key_vault.kv
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_key_vault_access_policy.permissions
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_key_vault_secret.sp_app_id
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_key_vault_secret.sp_object_id
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_key_vault_secret.sp_token
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_storage_account.sa
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].azurerm_storage_container.sc
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].random_uuid.app_uuid
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test1&#34;].time_rotating.one_year
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azuread_application.app
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azuread_application_password.token
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azuread_group.group[&#34;Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azuread_group.group[&#34;Key Vault Administrator&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azuread_group.group[&#34;Owner&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azuread_group.group[&#34;Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azuread_group.group[&#34;Security Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azuread_group.group[&#34;Storage Blob Data Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azuread_service_principal.sp
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azuredevops_serviceendpoint_azurerm.endpointazure
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_key_vault.kv
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_key_vault_access_policy.permissions
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_key_vault_secret.sp_app_id
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_key_vault_secret.sp_object_id
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_key_vault_secret.sp_token
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_storage_account.sa
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].azurerm_storage_container.sc
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].random_uuid.app_uuid
  * module.cft_non_production_subscriptions[&#34;DTS-Terraform-Dev-Test2&#34;].time_rotating.one_year
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;CFT-NonProd&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azuread_application.app will be created
  + resource "azuread_application" "app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "DTS Bootstrap (sub:DCD-RBAC-NONPRODUCTION)"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 1

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:DCD-RBAC-NONPRODUCTION) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:DCD-RBAC-NONPRODUCTION)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:DCD-RBAC-NONPRODUCTION) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:DCD-RBAC-NONPRODUCTION)"
              + value                      = "user_impersonation"
            }
        }

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
        }

      + web {
          + homepage_url = "https://dev.azure.com/hmcts/Operations"
        }
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = (known after apply)
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azuread_group.group["Contributor"] will be created
  + resource "azuread_group" "group" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants contributor permissions to the DCD-RBAC-NONPRODUCTION subscription"
      + display_name                   = "DTS Contributors (sub:DCD-RBAC-NONPRODUCTION)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azuread_group.group["Key Vault Administrator"] will be created
  + resource "azuread_group" "group" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants key vault administrator permissions to the DCD-RBAC-NONPRODUCTION subscription"
      + display_name                   = "DTS Key Vault Administrators (sub:DCD-RBAC-NONPRODUCTION)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azuread_group.group["Owner"] will be created
  + resource "azuread_group" "group" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants owner permissions to the DCD-RBAC-NONPRODUCTION subscription"
      + display_name                   = "DTS Owners (sub:DCD-RBAC-NONPRODUCTION)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azuread_group.group["Reader"] will be created
  + resource "azuread_group" "group" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants reader permissions to the DCD-RBAC-NONPRODUCTION subscription"
      + display_name                   = "DTS Readers (sub:DCD-RBAC-NONPRODUCTION)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = [
          + "74f495b8-66b2-4f43-ad96-d94fbb78cb26",
        ]
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azuread_group.group["Security Reader"] will be created
  + resource "azuread_group" "group" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the DCD-RBAC-NONPRODUCTION subscription"
      + display_name                   = "DTS Security Readers (sub:DCD-RBAC-NONPRODUCTION)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azuread_group.group["Storage Blob Data Reader"] will be created
  + resource "azuread_group" "group" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants storage blob data contributor permissions to the DCD-RBAC-NONPRODUCTION subscription"
      + display_name                   = "DTS Blob Readers (sub:DCD-RBAC-NONPRODUCTION)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azuread_service_principal.sp will be created
  + resource "azuread_service_principal" "sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azuredevops_serviceendpoint_azurerm.endpointazure will be created
  + resource "azuredevops_serviceendpoint_azurerm" "endpointazure" {
      + authorization             = (known after apply)
      + azurerm_spn_tenantid      = "e575f663-b30a-4786-89ad-319842dfe853"
      + azurerm_subscription_id   = "89678afe-decf-43ac-a878-64359bdbed56"
      + azurerm_subscription_name = "DCD-RBAC-NONPRODUCTION"
      + description               = "Managed by Terraform"
      + id                        = (known after apply)
      + project_id                = "PlatformOperations"
      + service_endpoint_name     = "DCD-RBAC-NONPRODUCTION"

      + credentials {
          + serviceprincipalid       = (known after apply)
          + serviceprincipalkey      = (sensitive value)
          + serviceprincipalkey_hash = (sensitive value)
        }
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "c89678afe9bdbed56kv"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "azure-control-sandbox-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + tenant_id                     = "e575f663-b30a-4786-89ad-319842dfe853"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azurerm_key_vault_access_policy.permissions will be created
  + resource "azurerm_key_vault_access_policy" "permissions" {
      + certificate_permissions = [
          + "Backup",
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "ManageContacts",
          + "ManageIssuers",
          + "Recover",
          + "Restore",
          + "SetIssuers",
          + "Update",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Backup",
          + "Create",
          + "Decrypt",
          + "Delete",
          + "Encrypt",
          + "Get",
          + "Import",
          + "List",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "Set",
          + "List",
          + "Delete",
          + "Restore",
          + "Recover",
          + "Backup",
        ]
      + storage_permissions     = [
          + "Backup",
          + "Delete",
          + "DeleteSAS",
          + "Get",
          + "GetSAS",
          + "List",
          + "ListSAS",
          + "Recover",
          + "RegenerateKey",
          + "Restore",
          + "Set",
          + "SetSAS",
          + "Update",
        ]
      + tenant_id               = "e575f663-b30a-4786-89ad-319842dfe853"
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azurerm_key_vault_secret.sp_app_id will be created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_non_production_subscriptions["DCD-RBAC-NONPRODUCTION"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_non_productio

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_role_assignment.local_groups["Contributor"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/269a14dc-30d9-4be4-91c5-69b15a050bd4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_role_assignment.local_groups["Key Vault Administrator"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/269a14dc-30d9-4be4-91c5-69b15a050bd4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_role_assignment.local_groups["Owner"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/269a14dc-30d9-4be4-91c5-69b15a050bd4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_role_assignment.local_groups["Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/269a14dc-30d9-4be4-91c5-69b15a050bd4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_role_assignment.local_groups["Security Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/subscriptions/269a14dc-30d9-4be4-91c5-69b15a050bd4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_role_assignment.local_groups["Storage Blob Data Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = "/subscriptions/269a14dc-30d9-4be4-91c5-69b15a050bd4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_role_assignment.local_role_assignments["Monitoring Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "74f495b8-66b2-4f43-ad96-d94fbb78cb26"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Contributor"
      + scope                            = "/subscriptions/269a14dc-30d9-4be4-91c5-69b15a050bd4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_role_assignment.local_role_assignments["Network Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "74f495b8-66b2-4f43-ad96-d94fbb78cb26"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/269a14dc-30d9-4be4-91c5-69b15a050bd4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_role_assignment.local_role_assignments["User Access Administrator"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "bf0db089-1d24-4480-abb4-d518b12c607d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/subscriptions/269a14dc-30d9-4be4-91c5-69b15a050bd4"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_storage_account.sa will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "c269a14dc5a050bd4sa"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "azure-control-sandbox-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].azurerm_storage_container.sc will be created
  + resource "azurerm_storage_container" "sc" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "subscription-tfstate"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "c269a14dc5a050bd4sa"
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.cft_non_production_subscriptions["DTS-Terraform-Dev-Test2"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.enterprise.azurerm_management_group.level_3["CFT-NonProd"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
        name                       = "CFT-NonProd"
      ~ subscription_ids           = [
          + "89678afe-decf-43ac-a878-64359bdbed56",
            # (2 unchanged elements hidden)
        ]
        # (2 unchanged attributes hidden)
    }

Plan: 93 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"","Target":"sandbox-uksouth-enterprise","Vars":{}} -->